piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/inc/MDR32VF0xI_adcui.h
#define IS_ADCUI_DATA_RESOL(RESOL) (((RESOL) == ADCUI_DATA_RESOL_16BIT) || \
                                    ((RESOL) == ADCUI_DATA_RESOL_24BIT))

/**
 * @brief ADCUI zero-cross low pass filter (ZXLPF).
 */
typedef enum {
    ADCUI_ZXLPF_FILTER_ENABLE  = (((uint32_t)0x0) << ADCUI_CTRL1_ZXLPF_Pos),
    ADCUI_ZXLPF_FILTER_DISABLE = (((uint32_t)0x1) << ADCUI_CTRL1_ZXLPF_Pos)
} ADCUI_ZeroCrossLowPassFilter_TypeDef;

#define IS_ZXLPF_FILTER(STATE) (((STATE) == ADCUI_ZXLPF_FILTER_ENABLE) || \
                                ((STATE) == ADCUI_ZXLPF_FILTER_DISABLE))

/**
 * @brief ADCUI period length (PER_LENGTH).
 */
typedef enum {
    ADCUI_PER_LENGTH_1   = ADCUI_CTRL1_PER_LENGHT_1,
    ADCUI_PER_LENGTH_2   = ADCUI_CTRL1_PER_LENGHT_2,
    ADCUI_PER_LENGTH_4   = ADCUI_CTRL1_PER_LENGHT_4,
    ADCUI_PER_LENGTH_8   = ADCUI_CTRL1_PER_LENGHT_8,
    ADCUI_PER_LENGTH_16  = ADCUI_CTRL1_PER_LENGHT_16,
    ADCUI_PER_LENGTH_32  = ADCUI_CTRL1_PER_LENGHT_32,
    ADCUI_PER_LENGTH_64  = ADCUI_CTRL1_PER_LENGHT_64,
    ADCUI_PER_LENGTH_128 = ADCUI_CTRL1_PER_LENGHT_128
} ADCUI_PeriodLength_TypeDef;

#define IS_ADCUI_PER_LENGTH(LENGTH) (((LENGTH) == ADCUI_PER_LENGTH_1) ||  \
                                     ((LENGTH) == ADCUI_PER_LENGTH_2) ||  \
                                     ((LENGTH) == ADCUI_PER_LENGTH_4) ||  \
                                     ((LENGTH) == ADCUI_PER_LENGTH_8) ||  \
                                     ((LENGTH) == ADCUI_PER_LENGTH_16) || \
                                     ((LENGTH) == ADCUI_PER_LENGTH_32) || \
                                     ((LENGTH) == ADCUI_PER_LENGTH_64) || \
                                     ((LENGTH) == ADCUI_PER_LENGTH_128))

/**
 * @brief ADCUI "No load" active power calculation mode (APNOLOAD).
 */
typedef enum {
    ADCUI_APNOLOAD_FULL = ADCUI_CTRL1_APNOLOAD_FULL,
#if defined(USE_MDR32F02_REV_2) || defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
    ADCUI_APNOLOAD_0p04914pct = (((uint32_t)0x3F) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p04836pct = (((uint32_t)0x3E) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p04758pct = (((uint32_t)0x3D) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p0468pct  = (((uint32_t)0x3C) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p04602pct = (((uint32_t)0x3B) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p04524pct = (((uint32_t)0x3A) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p04446pct = (((uint32_t)0x39) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p04368pct = (((uint32_t)0x38) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p0429pct  = (((uint32_t)0x37) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p04212pct = (((uint32_t)0x36) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p04134pct = (((uint32_t)0x35) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p04056pct = (((uint32_t)0x34) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p03978pct = (((uint32_t)0x33) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p039pct   = (((uint32_t)0x32) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p03822pct = (((uint32_t)0x31) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p03744pct = (((uint32_t)0x30) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p03666pct = (((uint32_t)0x2F) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p03588pct = (((uint32_t)0x2E) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p0351pct  = (((uint32_t)0x2D) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p03432pct = (((uint32_t)0x2C) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p03354pct = (((uint32_t)0x2B) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p03276pct = (((uint32_t)0x2A) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p03198ct  = (((uint32_t)0x29) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p0312pct  = (((uint32_t)0x28) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p03042pct = (((uint32_t)0x27) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p02964pct = (((uint32_t)0x26) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p02886pct = (((uint32_t)0x25) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p02808pct = (((uint32_t)0x24) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p0273pct  = (((uint32_t)0x23) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p02652pct = (((uint32_t)0x22) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p02574pct = (((uint32_t)0x21) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p02496pct = (((uint32_t)0x20) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p02418pct = (((uint32_t)0x1F) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p0234pct  = (((uint32_t)0x1E) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p02262pct = (((uint32_t)0x1D) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p02184pct = (((uint32_t)0x1C) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p02106pct = (((uint32_t)0x1B) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p02028pct = (((uint32_t)0x1A) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p0195pct  = (((uint32_t)0x19) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p01872pct = (((uint32_t)0x18) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p01794pct = (((uint32_t)0x17) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p01716pct = (((uint32_t)0x16) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p01638pct = (((uint32_t)0x15) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p0156pct  = (((uint32_t)0x14) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p01482pct = (((uint32_t)0x13) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p01404pct = (((uint32_t)0x12) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p01326pct = (((uint32_t)0x11) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p01248pct = (((uint32_t)0x10) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p0117pct  = (((uint32_t)0x0F) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p01092pct = (((uint32_t)0x0E) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p01014pct = (((uint32_t)0x0D) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p00936pct = (((uint32_t)0x0C) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p00858pct = (((uint32_t)0x0B) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p0078pct  = (((uint32_t)0x0A) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p00702pct = (((uint32_t)0x09) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p00624pct = (((uint32_t)0x08) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p00546pct = (((uint32_t)0x07) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p00468pct = (((uint32_t)0x06) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p0039pct  = (((uint32_t)0x05) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p00312pct = (((uint32_t)0x04) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p00234pct = (((uint32_t)0x03) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p00156pct = (((uint32_t)0x02) << ADCUI_LOAD_APNOLOAD_Pos),
    ADCUI_APNOLOAD_0p00078pct = (((uint32_t)0x01) << ADCUI_LOAD_APNOLOAD_Pos),
#endif
    ADCUI_APNOLOAD_0p012pct   = ADCUI_CTRL1_APNOLOAD_0p012pct,
    ADCUI_APNOLOAD_0p0061pct  = ADCUI_CTRL1_APNOLOAD_0p0061pct,
    ADCUI_APNOLOAD_0p00305pct = ADCUI_CTRL1_APNOLOAD_0p00305pct
} ADCUI_ActivePowerNoLoad_TypeDef;

