piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/inc/MDR32VF0xI_adcui.h
#if defined(USE_MDR32F02_REV_1X)
#define IS_ADCUI_APNOLOAD(LOAD) (((LOAD) == ADCUI_APNOLOAD_FULL) ||      \
                                 ((LOAD) == ADCUI_APNOLOAD_0p012pct) ||  \
                                 ((LOAD) == ADCUI_APNOLOAD_0p0061pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p00305pct))
#else
#define IS_ADCUI_APNOLOAD(LOAD) (((LOAD) == ADCUI_APNOLOAD_FULL) ||       \
                                 ((LOAD) == ADCUI_APNOLOAD_0p04914pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p04836pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p04758pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p0468pct) ||  \
                                 ((LOAD) == ADCUI_APNOLOAD_0p04602pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p04524pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p04446pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p04368pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p0429pct) ||  \
                                 ((LOAD) == ADCUI_APNOLOAD_0p04212pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p04134pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p04056pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p03978pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p039pct) ||   \
                                 ((LOAD) == ADCUI_APNOLOAD_0p03822pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p03744pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p03666pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p03588pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p0351pct) ||  \
                                 ((LOAD) == ADCUI_APNOLOAD_0p03432pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p03354pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p03276pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p03198ct) ||  \
                                 ((LOAD) == ADCUI_APNOLOAD_0p0312pct) ||  \
                                 ((LOAD) == ADCUI_APNOLOAD_0p03042pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p02964pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p02886pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p02808pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p0273pct) ||  \
                                 ((LOAD) == ADCUI_APNOLOAD_0p02652pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p02574pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p02496pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p02418pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p0234pct) ||  \
                                 ((LOAD) == ADCUI_APNOLOAD_0p02262pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p02184pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p02106pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p02028pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p0195pct) ||  \
                                 ((LOAD) == ADCUI_APNOLOAD_0p01872pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p01794pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p01716pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p01638pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p0156pct) ||  \
                                 ((LOAD) == ADCUI_APNOLOAD_0p01482pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p01404pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p01326pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p01248pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p0117pct) ||  \
                                 ((LOAD) == ADCUI_APNOLOAD_0p01092pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p01014pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p00936pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p00858pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p0078pct) ||  \
                                 ((LOAD) == ADCUI_APNOLOAD_0p00702pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p00624pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p00546pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p00468pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p0039pct) ||  \
                                 ((LOAD) == ADCUI_APNOLOAD_0p00312pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p00234pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p00156pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p00078pct) || \
                                 ((LOAD) == ADCUI_APNOLOAD_0p012pct) ||   \
                                 ((LOAD) == ADCUI_APNOLOAD_0p0061pct) ||  \
                                 ((LOAD) == ADCUI_APNOLOAD_0p00305pct))
#endif

/**
 * @brief ADCUI "No load" reactive power calculation mode (VARNOLOAD).
 */
typedef enum {
    ADCUI_VARNOLOAD_FULL = ADCUI_CTRL1_VARNOLOAD_FULL,
#if defined(USE_MDR32F02_REV_2) || defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
    ADCUI_VARNOLOAD_0p04914pct = (((uint32_t)0x3F) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p04836pct = (((uint32_t)0x3E) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p04758pct = (((uint32_t)0x3D) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p0468pct  = (((uint32_t)0x3C) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p04602pct = (((uint32_t)0x3B) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p04524pct = (((uint32_t)0x3A) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p04446pct = (((uint32_t)0x39) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p04368pct = (((uint32_t)0x38) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p0429pct  = (((uint32_t)0x37) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p04212pct = (((uint32_t)0x36) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p04134pct = (((uint32_t)0x35) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p04056pct = (((uint32_t)0x34) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p03978pct = (((uint32_t)0x33) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p039pct   = (((uint32_t)0x32) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p03822pct = (((uint32_t)0x31) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p03744pct = (((uint32_t)0x30) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p03666pct = (((uint32_t)0x2F) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p03588pct = (((uint32_t)0x2E) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p0351pct  = (((uint32_t)0x2D) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p03432pct = (((uint32_t)0x2C) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p03354pct = (((uint32_t)0x2B) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p03276pct = (((uint32_t)0x2A) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p03198ct  = (((uint32_t)0x29) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p0312pct  = (((uint32_t)0x28) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p03042pct = (((uint32_t)0x27) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p02964pct = (((uint32_t)0x26) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p02886pct = (((uint32_t)0x25) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p02808pct = (((uint32_t)0x24) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p0273pct  = (((uint32_t)0x23) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p02652pct = (((uint32_t)0x22) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p02574pct = (((uint32_t)0x21) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p02496pct = (((uint32_t)0x20) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p02418pct = (((uint32_t)0x1F) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p0234pct  = (((uint32_t)0x1E) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p02262pct = (((uint32_t)0x1D) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p02184pct = (((uint32_t)0x1C) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p02106pct = (((uint32_t)0x1B) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p02028pct = (((uint32_t)0x1A) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p0195pct  = (((uint32_t)0x19) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p01872pct = (((uint32_t)0x18) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p01794pct = (((uint32_t)0x17) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p01716pct = (((uint32_t)0x16) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p01638pct = (((uint32_t)0x15) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p0156pct  = (((uint32_t)0x14) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p01482pct = (((uint32_t)0x13) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p01404pct = (((uint32_t)0x12) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p01326pct = (((uint32_t)0x11) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p01248pct = (((uint32_t)0x10) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p0117pct  = (((uint32_t)0x0F) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p01092pct = (((uint32_t)0x0E) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p01014pct = (((uint32_t)0x0D) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p00936pct = (((uint32_t)0x0C) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p00858pct = (((uint32_t)0x0B) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p0078pct  = (((uint32_t)0x0A) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p00702pct = (((uint32_t)0x09) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p00624pct = (((uint32_t)0x08) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p00546pct = (((uint32_t)0x07) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p00468pct = (((uint32_t)0x06) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p0039pct  = (((uint32_t)0x05) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p00312pct = (((uint32_t)0x04) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p00234pct = (((uint32_t)0x03) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p00156pct = (((uint32_t)0x02) << ADCUI_LOAD_VARNOLOAD_Pos),
    ADCUI_VARNOLOAD_0p00078pct = (((uint32_t)0x01) << ADCUI_LOAD_VARNOLOAD_Pos),
#endif
    ADCUI_VARNOLOAD_0p012pct   = ADCUI_CTRL1_VARNOLOAD_0p012pct,
    ADCUI_VARNOLOAD_0p0061pct  = ADCUI_CTRL1_VARNOLOAD_0p0061pct,
    ADCUI_VARNOLOAD_0p00305pct = ADCUI_CTRL1_VARNOLOAD_0p00305pct
} ADCUI_ReactivePowerNoLoad_TypeDef;

