piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/inc/MDR32VF0xI_adcui.h
#if defined(USE_MDR32F02_REV_1X)
#define IS_ADCUI_VANOLOAD(LOAD) (((LOAD) == ADCUI_VANOLOAD_FULL) ||      \
                                 ((LOAD) == ADCUI_VANOLOAD_0p012pct) ||  \
                                 ((LOAD) == ADCUI_VANOLOAD_0p0061pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p00305pct))
#else
#define IS_ADCUI_VANOLOAD(LOAD) (((LOAD) == ADCUI_VANOLOAD_FULL) ||       \
                                 ((LOAD) == ADCUI_VANOLOAD_0p09828pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p09672pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p09516pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p0936pct) ||  \
                                 ((LOAD) == ADCUI_VANOLOAD_0p09204pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p09048pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p08892pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p08736pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p0858pct) ||  \
                                 ((LOAD) == ADCUI_VANOLOAD_0p08424pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p08268pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p08112pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p07956pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p078pct) ||   \
                                 ((LOAD) == ADCUI_VANOLOAD_0p07644pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p07488pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p07332pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p07176pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p0702pct) ||  \
                                 ((LOAD) == ADCUI_VANOLOAD_0p06864pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p06708pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p06552pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p06396pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p0624pct) ||  \
                                 ((LOAD) == ADCUI_VANOLOAD_0p06084pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p05928pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p05772pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p05616pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p0546pct) ||  \
                                 ((LOAD) == ADCUI_VANOLOAD_0p05304pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p05148pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p04992pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p04836pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p0468pct) ||  \
                                 ((LOAD) == ADCUI_VANOLOAD_0p04524pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p04368pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p04212pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p04056pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p039pct) ||   \
                                 ((LOAD) == ADCUI_VANOLOAD_0p03744pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p03588pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p03432pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p03276pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p0312pct) ||  \
                                 ((LOAD) == ADCUI_VANOLOAD_0p02964pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p02808pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p02652pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p02496pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p0234pct) ||  \
                                 ((LOAD) == ADCUI_VANOLOAD_0p02184pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p02028pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p01872pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p01716pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p0156pct) ||  \
                                 ((LOAD) == ADCUI_VANOLOAD_0p01404pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p01248pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p01092pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p00936pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p0078pct) ||  \
                                 ((LOAD) == ADCUI_VANOLOAD_0p00624pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p00468pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p00312pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p00156pct) || \
                                 ((LOAD) == ADCUI_VANOLOAD_0p012pct) ||   \
                                 ((LOAD) == ADCUI_VANOLOAD_0p0061pct) ||  \
                                 ((LOAD) == ADCUI_VANOLOAD_0p00305pct))
#endif

/**
 * @brief ADCUI reference voltage configuration (VREF_SEL).
 */
typedef enum {
    ADCUI_REFERENCE_VOLTAGE_INTERNAL = (((uint32_t)0x1) << ADCUI_CTRL1_VREF_SEL_Pos),
    ADCUI_REFERENCE_VOLTAGE_EXTERNAL = (((uint32_t)0x0) << ADCUI_CTRL1_VREF_SEL_Pos)
} ADCUI_VRefConfig_TypeDef;

#define IS_ADCUI_REFERENCE_VOLTAGE(RV) (((RV) == ADCUI_REFERENCE_VOLTAGE_INTERNAL) || \
                                        ((RV) == ADCUI_REFERENCE_VOLTAGE_EXTERNAL))

/**
 * @brief ADCUI zero-cross update RMS value (ZXRMS).
 */
typedef enum {
    ADCUI_REG_CONTINUOUS_UPDATE = (((uint32_t)0x0) << ADCUI_CTRL1_ZXRMS_Pos),
    ADCUI_REG_UPDATE_BY_ZERO    = (((uint32_t)0x1) << ADCUI_CTRL1_ZXRMS_Pos)
} ADCUI_ZeroCrossUpdateRMS_TypeDef;

#define IS_ADCUI_ZXRMS_REG_UPDATE(UPDATE) (((UPDATE) == ADCUI_REG_CONTINUOUS_UPDATE) || \
                                           ((UPDATE) == ADCUI_REG_UPDATE_BY_ZERO))
/**
 * @brief ADCUI oversampling divider (OSR_CONF).
 */
typedef enum {
#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
    ADCUI_OVERSAMPLING_DIV_1024 = ((uint32_t)(0x00) << ADCUI_CTRL1_OSR_CONF_Pos),     /*!< Frequency ADCUI divider (depends on the CLC_ADC_CFG setting). */
    ADCUI_OVERSAMPLING_DIV_512  = ((uint32_t)(0x01) << ADCUI_CTRL1_OSR_CONF_Pos),     /*!< Frequency ADCUI divider (depends on the CLC_ADC_CFG setting). */
    ADCUI_OVERSAMPLING_DIV_256  = (int)((uint32_t)(0x02) << ADCUI_CTRL1_OSR_CONF_Pos) /*!< Frequency ADCUI divider (depends on the CLC_ADC_CFG setting). */
#endif

#if defined(USE_MDR32F02_REV_1X) || defined(USE_MDR32F02_REV_2)
    ADCUI_OVERSAMPLING_DIV_256 = ((uint32_t)(0x00) << ADCUI_CTRL1_OSR_CONF_Pos),     /*!< Sampling frequency 4kHz. */
    ADCUI_OVERSAMPLING_DIV_128 = ((uint32_t)(0x01) << ADCUI_CTRL1_OSR_CONF_Pos),     /*!< Sampling frequency 8kHz. */
    ADCUI_OVERSAMPLING_DIV_64  = (int)((uint32_t)(0x02) << ADCUI_CTRL1_OSR_CONF_Pos) /*!< Sampling frequency 16kHz. */
#endif
} ADCUI_Divider_TypeDef;

