piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/inc/MDR32VF0xI_adcui.h
#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
#define IS_ADCUI_OSR_COF(COF) (((COF) == ADCUI_OVERSAMPLING_DIV_1024) || \
                               ((COF) == ADCUI_OVERSAMPLING_DIV_512) ||  \
                               ((COF) == ADCUI_OVERSAMPLING_DIV_256))
#endif

#if defined(USE_MDR32F02_REV_1X) || defined(USE_MDR32F02_REV_2)
#define IS_ADCUI_OSR_COF(COF) (((COF) == ADCUI_OVERSAMPLING_DIV_256) || \
                               ((COF) == ADCUI_OVERSAMPLING_DIV_128) || \
                               ((COF) == ADCUI_OVERSAMPLING_DIV_64))
#endif

/**
 * @brief ADCUI clock frequency (CLC_ADC_CFG).
 */
#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
typedef enum {
    ADCUI_CLK_FREQUENCY_4MHz = ((uint32_t)(0x00) << ADCUI_CLKPHASE1_CLC_ADC_CFG_Pos),
    ADCUI_CLK_FREQUENCY_2MHz = ((uint32_t)(0x01) << ADCUI_CLKPHASE1_CLC_ADC_CFG_Pos),
    ADCUI_CLK_FREQUENCY_1MHz = (int)((uint32_t)(0x02) << ADCUI_CLKPHASE1_CLC_ADC_CFG_Pos)
} ADCUI_ClockFrequency_TypeDef;

#define IS_ADCUI_CLK_FREQUENCY(FREQ) (((FREQ) == ADCUI_CLK_FREQUENCY_4MHz) || \
                                      ((FREQ) == ADCUI_CLK_FREQUENCY_2MHz) || \
                                      ((FREQ) == ADCUI_CLK_FREQUENCY_1MHz))
#endif

#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
#define IS_ADCUI_CLK_OSR_VALID(FREQ, COF) ((((FREQ) == ADCUI_CLK_FREQUENCY_1MHz) && ((COF) == ADCUI_OVERSAMPLING_DIV_256)) || \
                                           (((FREQ) == ADCUI_CLK_FREQUENCY_2MHz) && ((COF) == ADCUI_OVERSAMPLING_DIV_256)) || \
                                           (((FREQ) == ADCUI_CLK_FREQUENCY_2MHz) && ((COF) == ADCUI_OVERSAMPLING_DIV_512)) || \
                                           (((FREQ) == ADCUI_CLK_FREQUENCY_4MHz) && ((COF) == ADCUI_OVERSAMPLING_DIV_256)) || \
                                           (((FREQ) == ADCUI_CLK_FREQUENCY_4MHz) && ((COF) == ADCUI_OVERSAMPLING_DIV_512)) || \
                                           (((FREQ) == ADCUI_CLK_FREQUENCY_4MHz) && ((COF) == ADCUI_OVERSAMPLING_DIV_1024)))
#endif

/**
 * @brief ADCUI chopper period setting (CHP_ADC_CFG).
 */

#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
typedef enum {
    ADCUI_CHOPPER_PERIOD_256  = ((uint32_t)(0x00) << ADCUI_FILTERCFG_CHP_ADC_CFG_Pos), /*!< The chopper period is 256 periods of the ADC clock signal (recommended for OSR_CONF = 256) */
    ADCUI_CHOPPER_PERIOD_512  = ((uint32_t)(0x01) << ADCUI_FILTERCFG_CHP_ADC_CFG_Pos), /*!< The chopper period is 512 periods of the ADC clock signal (recommended for OSR_CONF = 512) */
    ADCUI_CHOPPER_PERIOD_1024 = ((uint32_t)(0x02) << ADCUI_FILTERCFG_CHP_ADC_CFG_Pos)  /*!< The chopper period is 1024 periods of the ADC clock signal (recommended for OSR_CONF = 1024) */
} ADCUI_ChopperPeriod_TypeDef;

#define IS_ADCUI_CHOPPER_PERIOD(PERIOD) (((PERIOD) == ADCUI_CHOPPER_PERIOD_256) || \
                                         ((PERIOD) == ADCUI_CHOPPER_PERIOD_512) || \
                                         ((PERIOD) == ADCUI_CHOPPER_PERIOD_1024))
#endif

/**
 * @brief ADCUI Fx integrator state in the I channel (FxINTEN).
 */
typedef enum {
    ADCUI_INT_ENABLE  = (uint32_t)(0x00),
    ADCUI_INT_DISABLE = (uint32_t)(0x01)
} ADCUI_IntegratorState_TypeDef;

#define IS_ADCUI_INT_STATE(STATE) (((STATE) == ADCUI_INT_ENABLE) || \
                                   ((STATE) == ADCUI_INT_DISABLE))

/**
 * @brief ADCUI source selection to store in full energy register VADATA (FxVASEL).
 */
typedef enum {
    ADCUI_FULL_ENERGY = (((uint32_t)0x0) << ADCUI_FxCTR_FxVASEL_Pos),
    ADCUI_RMS_CURRENT = (((uint32_t)0x1) << ADCUI_FxCTR_FxVASEL_Pos)
} ADCUI_SourceRegFullPower_TypeDef;

#define IS_ADCUI_VASEL(VASEL) (((VASEL) == ADCUI_FULL_ENERGY) || \
                               ((VASEL) == ADCUI_RMS_CURRENT))

/**
 * @brief ADCUI Fx gain in V channel (FxVGAIN).
 */
typedef enum {
    ADCUI_VGAIN_0dB  = (uint32_t)(0x00),
    ADCUI_VGAIN_6dB  = (uint32_t)(0x01),
    ADCUI_VGAIN_12dB = (uint32_t)(0x02),
    ADCUI_VGAIN_18dB = (uint32_t)(0x03)
} ADCUI_VGain_TypeDef;

#define IS_ADCUI_VGAIN(VGAIN) (((VGAIN) == ADCUI_VGAIN_0dB) ||  \
                               ((VGAIN) == ADCUI_VGAIN_6dB) ||  \
                               ((VGAIN) == ADCUI_VGAIN_12dB) || \
                               ((VGAIN) == ADCUI_VGAIN_18dB))

/**
 * @brief ADCUI Fx gain in I channel (FxIGAIN).
 */
typedef enum {
#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
    ADCUI_IGAIN_6dB  = (uint32_t)(0x00),
    ADCUI_IGAIN_12dB = (uint32_t)(0x01),
    ADCUI_IGAIN_18dB = (uint32_t)(0x02),
    ADCUI_IGAIN_24dB = (uint32_t)(0x03)
#endif

#if defined(USE_MDR32F02_REV_1X) || defined(USE_MDR32F02_REV_2)
        ADCUI_IGAIN_0dB = (uint32_t)(0x00),
    ADCUI_IGAIN_6dB     = (uint32_t)(0x01),
    ADCUI_IGAIN_12dB    = (uint32_t)(0x02),
    ADCUI_IGAIN_18dB    = (uint32_t)(0x03)
#endif
} ADCUI_IGain_TypeDef;

#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
#define IS_ADCUI_IGAIN(IGAIN) (((IGAIN) == ADCUI_IGAIN_6dB) ||  \
                               ((IGAIN) == ADCUI_IGAIN_12dB) || \
                               ((IGAIN) == ADCUI_IGAIN_18dB) || \
                               ((IGAIN) == ADCUI_IGAIN_24dB))
#endif

#if defined(USE_MDR32F02_REV_1X) || defined(USE_MDR32F02_REV_2)
#define IS_ADCUI_IGAIN(IGAIN) (((IGAIN) == ADCUI_IGAIN_0dB) ||  \
                               ((IGAIN) == ADCUI_IGAIN_6dB) ||  \
                               ((IGAIN) == ADCUI_IGAIN_12dB) || \
                               ((IGAIN) == ADCUI_IGAIN_18dB))
#endif

/**
 * @brief ADCUI Fx unit number.
 */
typedef enum {
    ADCUI_F0_UNIT = (uint32_t)(0x00),
    ADCUI_F1_UNIT = (uint32_t)(0x01),
    ADCUI_F2_UNIT = (uint32_t)(0x02)
} ADCUI_Unit_TypeDef;

#define IS_ADCUI_UNIT(UNIT) (((UNIT) == ADCUI_F0_UNIT) || \
                             ((UNIT) == ADCUI_F1_UNIT) || \
                             ((UNIT) == ADCUI_F2_UNIT))

/**
 * @brief ADCUI power type.
 */
typedef enum {
    ADCUI_POWER_ACTIVE   = (uint32_t)(0x00),
    ADCUI_POWER_REACTIVE = (uint32_t)(0x01),
    ADCUI_POWER_FULL     = (uint32_t)(0x02)
} ADCUI_Power_TypeDef;

#define IS_ADCUI_POWER(PWR) (((PWR) == ADCUI_POWER_ACTIVE) ||   \
                             ((PWR) == ADCUI_POWER_REACTIVE) || \
                             ((PWR) == ADCUI_POWER_FULL))

#define IS_ADCUI_POWERS(PWRS) (((PWRS) & ~(uint32_t)(ADCUI_POWER_ACTIVE |   \
                                                     ADCUI_POWER_REACTIVE | \
                                                     ADCUI_POWER_FULL)) == 0)

/**
 * @brief ADCUI select a signal source for the ADCUI_FxVDAT (FxVSEL).
 */
typedef enum {
    ADCUI_Fx_VDAT_U_BEFORE_HPF   = ((uint32_t)(0x00) << ADCUI_FxMD0_FxVSEL_Pos),
    ADCUI_Fx_VDAT_ACTIVE_POWER   = ((uint32_t)(0x01) << ADCUI_FxMD0_FxVSEL_Pos),
    ADCUI_Fx_VDAT_REACTIVE_POWER = ((uint32_t)(0x02) << ADCUI_FxMD0_FxVSEL_Pos),
    ADCUI_Fx_VDAT_U_AFTER_HPF    = ((uint32_t)(0x03) << ADCUI_FxMD0_FxVSEL_Pos)
} ADCUI_Fx_SourceVDAT_TypeDef;

#define IS_ADCUI_VDAT_SOURCE(SOURCE) (((SOURCE) == ADCUI_Fx_VDAT_U_BEFORE_HPF) ||   \
                                      ((SOURCE) == ADCUI_Fx_VDAT_ACTIVE_POWER) ||   \
                                      ((SOURCE) == ADCUI_Fx_VDAT_REACTIVE_POWER) || \
                                      ((SOURCE) == ADCUI_Fx_VDAT_U_AFTER_HPF))

/**
 * @brief ADCUI select a signal source for the ADCUI_FxIDAT (FxISEL).
 */
typedef enum {
    ADCUI_Fx_IDAT_I              = ((uint32_t)(0x00) << ADCUI_FxMD0_FxISEL_Pos),
    ADCUI_Fx_IDAT_ACTIVE_POWER   = ((uint32_t)(0x01) << ADCUI_FxMD0_FxISEL_Pos),
    ADCUI_Fx_IDAT_REACTIVE_POWER = ((uint32_t)(0x02) << ADCUI_FxMD0_FxISEL_Pos),
    ADCUI_Fx_IDAT_FULL_POWER     = ((uint32_t)(0x03) << ADCUI_FxMD0_FxISEL_Pos)
} ADCUI_Fx_SourceIDAT_TypeDef;

#define IS_ADCUI_IDAT_SOURCE(SOURCE) (((SOURCE) == ADCUI_Fx_IDAT_I) ||              \
                                      ((SOURCE) == ADCUI_Fx_IDAT_ACTIVE_POWER) ||   \
                                      ((SOURCE) == ADCUI_Fx_IDAT_REACTIVE_POWER) || \
                                      ((SOURCE) == ADCUI_Fx_IDAT_FULL_POWER))

/**
 * @brief Specify the data (before or after the HPF filter) to be written into the ADCUI_F0I3DAT register in the F0I3SEL.
 */
typedef enum {
    ADCUI_F0I3SEL_AFTER_HPF  = (((uint32_t)0x0) << ADCUI_F0AC_F0I3SEL_Pos),
    ADCUI_F0I3SEL_BEFORE_HPF = (((uint32_t)0x1) << ADCUI_F0AC_F0I3SEL_Pos)
} ADCUI_F0_I3SelectDataFilter_TypeDef;

#define IS_ADCUI_F0I3SEL_SELECT(SELECT) (((SELECT) == ADCUI_F0I3SEL_AFTER_HPF) || \
                                         ((SELECT) == ADCUI_F0I3SEL_BEFORE_HPF))

/**
 * @brief Specify the data (before or after the HPF filter) to be written into the ADCUI_FxIDAT register.
 */
#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
typedef enum {
    ADCUI_FxISEL_BEFORE_HPF = ((uint32_t)0x0),
    ADCUI_FxISEL_AFTER_HPF  = ((uint32_t)0x1)
} ADCUI_Fx_ISelectDataFilter_TypeDef;

#define IS_ADCUI_FxISEL_SELECT(SELECT) (((SELECT) == ADCUI_FxISEL_BEFORE_HPF) || \
                                        ((SELECT) == ADCUI_FxISEL_AFTER_HPF))
#endif

/**
 * @brief Active current channel in the unit F0 (F0SEL_I_CH).
 */
typedef enum {
    ADCUI_F0_I_CH_AUTO = ((uint32_t)(0x00) << ADCUI_F0MD0_F0SEL_I_CH_Pos),
    ADCUI_F0_I_CH_I0   = ((uint32_t)(0x01) << ADCUI_F0MD0_F0SEL_I_CH_Pos),
    ADCUI_F0_I_CH_I3   = (int)((uint32_t)(0x02) << ADCUI_F0MD0_F0SEL_I_CH_Pos)
} ADCUI_F0_IChannelSelect_TypeDef;

