piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/inc/MDR32VF0xI_adcui.h
#define IS_ADCUI_CHANNELI_SELECT(SELECT) (((SELECT) == ADCUI_F0_I_CH_AUTO) || \
                                          ((SELECT) == ADCUI_F0_I_CH_I0) ||   \
                                          ((SELECT) == ADCUI_F0_I_CH_I3))

/**
 * @brief Selecting DMA operating mode (single or block transactions).
 */
#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
typedef enum {
    ADCUI_DMA_TRANSACTIONS_SINGLE = ((uint32_t)0x0),
    ADCUI_DMA_TRANSACTIONS_BLOCK  = ((uint32_t)0x1)
} ADCUI_DmaTransMode_TypeDef;

#define IS_ADCUI_DMA_TRANSACTIONS_MODE(MODE) (((MODE) == ADCUI_DMA_TRANSACTIONS_SINGLE) || \
                                              ((MODE) == ADCUI_DMA_TRANSACTIONS_BLOCK))
#endif

/**
 * @brief ADCUI interrupt definition.
 */
typedef enum {
    ADCUI_Fx_IT_VF_EMP   = ADCUI_FxSTAT_FxVF_EMP,
    ADCUI_Fx_IT_VF_FLL   = ADCUI_FxSTAT_FxVF_FLL,
    ADCUI_Fx_IT_VF_OVR   = ADCUI_FxSTAT_FxVF_OVR,
    ADCUI_Fx_IT_IF_EMP   = ADCUI_FxSTAT_FxIF_EMP,
    ADCUI_Fx_IT_IF_FLL   = ADCUI_FxSTAT_FxIF_FLL,
    ADCUI_Fx_IT_IF_OVR   = ADCUI_FxSTAT_FxIF_OVR,
    ADCUI_Fx_IT_SAGF     = ADCUI_FxSTAT_FxSAGF,
    ADCUI_Fx_IT_PEAKVF   = ADCUI_FxSTAT_FxPEAKVF,
    ADCUI_Fx_IT_PEAKIF   = ADCUI_FxSTAT_FxPEAKIF,
    ADCUI_Fx_IT_WATTOVP  = ADCUI_FxSTAT_FxWATTOVP,
    ADCUI_Fx_IT_VAROVP   = ADCUI_FxSTAT_FxVAROVP,
    ADCUI_Fx_IT_VAOV     = ADCUI_FxSTAT_FxVAOV,
    ADCUI_Fx_IT_ZXTOF    = ADCUI_FxSTAT_FxZXTOF,
    ADCUI_Fx_IT_APSIGN   = ADCUI_FxSTAT_FxAPSIGN,
    ADCUI_Fx_IT_APNLDFL  = ADCUI_FxSTAT_FxAPNLDFL,
    ADCUI_Fx_IT_VARSIGN  = ADCUI_FxSTAT_FxVARSIGN,
    ADCUI_Fx_IT_VARNLDFL = ADCUI_FxSTAT_FxVARNLDFL,
    ADCUI_Fx_IT_VANLDFL  = ADCUI_FxSTAT_FxVANLDFL,
    ADCUI_Fx_IT_ZEROCRS  = ADCUI_FxSTAT_FxZEROCRS,
    ADCUI_Fx_IT_C3IF_EMP = ADCUI_F0STAT_C3IF_EMP,
    ADCUI_Fx_IT_C3IF_FLL = ADCUI_F0STAT_C3IF_FLL,
    ADCUI_Fx_IT_C3IF_OVR = ADCUI_F0STAT_C3IF_OVR,
    ADCUI_Fx_IT_WATTOVN  = ADCUI_FxSTAT_FxWATTOVN,
    ADCUI_Fx_IT_VAROVN   = ADCUI_FxSTAT_FxVAROVN
} ADCUI_IT_TypeDef;

#define ADCUI_IT_MASK (ADCUI_Fx_IT_VF_EMP |   \
                       ADCUI_Fx_IT_VF_FLL |   \
                       ADCUI_Fx_IT_VF_OVR |   \
                       ADCUI_Fx_IT_IF_EMP |   \
                       ADCUI_Fx_IT_IF_FLL |   \
                       ADCUI_Fx_IT_IF_OVR |   \
                       ADCUI_Fx_IT_SAGF |     \
                       ADCUI_Fx_IT_PEAKVF |   \
                       ADCUI_Fx_IT_PEAKIF |   \
                       ADCUI_Fx_IT_WATTOVP |  \
                       ADCUI_Fx_IT_VAROVP |   \
                       ADCUI_Fx_IT_VAOV |     \
                       ADCUI_Fx_IT_ZXTOF |    \
                       ADCUI_Fx_IT_APSIGN |   \
                       ADCUI_Fx_IT_APNLDFL |  \
                       ADCUI_Fx_IT_VARSIGN |  \
                       ADCUI_Fx_IT_VARNLDFL | \
                       ADCUI_Fx_IT_VANLDFL |  \
                       ADCUI_Fx_IT_ZEROCRS |  \
                       ADCUI_Fx_IT_C3IF_EMP | \
                       ADCUI_Fx_IT_C3IF_FLL | \
                       ADCUI_Fx_IT_C3IF_OVR | \
                       ADCUI_Fx_IT_WATTOVN |  \
                       ADCUI_Fx_IT_VAROVN)

#define IS_ADCUI_ITS(IT)       (((IT) & (~(uint32_t)ADCUI_IT_MASK)) == 0)

#define IS_ADCUI_CONFIG_IT(IT) (((IT) == ADCUI_Fx_IT_VF_EMP) || ((IT) == ADCUI_Fx_IT_VF_FLL) ||     \
                                ((IT) == ADCUI_Fx_IT_VF_OVR) || ((IT) == ADCUI_Fx_IT_IF_EMP) ||     \
                                ((IT) == ADCUI_Fx_IT_IF_FLL) || ((IT) == ADCUI_Fx_IT_IF_OVR) ||     \
                                ((IT) == ADCUI_Fx_IT_SAGF) || ((IT) == ADCUI_Fx_IT_PEAKVF) ||       \
                                ((IT) == ADCUI_Fx_IT_PEAKIF) || ((IT) == ADCUI_Fx_IT_WATTOVP) ||    \
                                ((IT) == ADCUI_Fx_IT_VAROVP) || ((IT) == ADCUI_Fx_IT_VAOV) ||       \
                                ((IT) == ADCUI_Fx_IT_ZXTOF) || ((IT) == ADCUI_Fx_IT_APSIGN) ||      \
                                ((IT) == ADCUI_Fx_IT_APNLDFL) || ((IT) == ADCUI_Fx_IT_VARSIGN) ||   \
                                ((IT) == ADCUI_Fx_IT_VARNLDFL) || ((IT) == ADCUI_Fx_IT_VANLDFL) ||  \
                                ((IT) == ADCUI_Fx_IT_ZEROCRS) || ((IT) == ADCUI_Fx_IT_C3IF_EMP) ||  \
                                ((IT) == ADCUI_Fx_IT_C3IF_FLL) || ((IT) == ADCUI_Fx_IT_C3IF_OVR) || \
                                ((IT) == ADCUI_Fx_IT_WATTOVN) || ((IT) == ADCUI_Fx_IT_VAROVN))

/**
 * @brief ADCUI init structure definition.
 */
typedef struct {
    ADCUI_DataResol_TypeDef ADCUI_DataResol;                           /*!< Output data resolution.
                                                                            This parameter can be a value of the @ref ADCUI_DataResol_TypeDef. */
    ADCUI_ZeroCrossLowPassFilter_TypeDef ADCUI_ZeroCrossLowPassFilter; /*!< The state of the ZXLPF filter.
                                                                            This parameter can be a value of the @ref ADCUI_ZeroCrossLowPassFilter_TypeDef. */
    ADCUI_PeriodLength_TypeDef ADCUI_PeriodLength;                     /*!< Period and phase shift the calculation range.
                                                                            This parameter can be a value of the @ref ADCUI_PeriodLength_TypeDef. */
    ADCUI_ActivePowerNoLoad_TypeDef ADCUI_ActivePowerNoLoad;           /*!< No-load mode for the active energy calculation.
                                                                            This parameter can be a value of the @ref ADCUI_ActivePowerNoLoad_TypeDef. */
    ADCUI_ReactivePowerNoLoad_TypeDef ADCUI_ReactivePowerNoLoad;       /*!< No-load mode for the reactive energy calculation.
                                                                            This parameter can be a value of the @ref ADCUI_ReactivePowerNoLoad_TypeDef. */
    ADCUI_FullPowerNoLoad_TypeDef ADCUI_FullPowerNoLoad;               /*!< No-load mode for the total energy calculation.
                                                                            This parameter can be a value of the @ref ADCUI_FullPowerNoLoad_TypeDef. */
    FunctionalState ADCUI_FreqVEnable;                                 /*!< Permission to calculate a period in the voltage channels (FREQSEL).
                                                                            This parameter can be a value of the @ref FunctionalState. */
    ADCUI_VRefConfig_TypeDef ADCUI_VRefConfig;                         /*!< Selection of the reference voltage for the ADC and ADCUI.
                                                                            This parameter can be a value of the @ref ADCUI_VRefConfig_TypeDef. */
    ADCUI_ZeroCrossUpdateRMS_TypeDef ADCUI_ZeroCrossUpdateRMS;         /*!< RMS Register Update Controls.
                                                                            This parameter can be a value of the @ref ADCUI_ZeroCrossUpdateRMS_TypeDef. */
#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
    ADCUI_ClockFrequency_TypeDef ADCUI_ClockFrequency; /*!< Selecting the ADC clock frequency.
                                                This parameter can be a value of the @ref ADCUI_ClockFrequency_TypeDef. */
    ADCUI_ChopperPeriod_TypeDef ADCUI_ChopperPeriod;   /*!< Setting the ADC chopper period of all channels.
                                                This parameter can be a value of the @ref ADCUI_ChopperPeriod_TypeDef. */
#endif
    ADCUI_Divider_TypeDef ADCUI_Divider; /*!< Selection of the oversampling factor.
                                              This parameter can be a value of the @ref ADCUI_Divider_TypeDef. */
    uint16_t ADCUI_VoltageDropLevel;     /*!< Permitted voltage drop level.
                                              This parameter is an even number from 0 to 65536. */
    uint8_t ADCUI_VoltageHalfCyclesDrop; /*!< The number of half-cycles of voltage to calculate the drawdown of the voltage level.
                                              This parameter is an even number from 0 to 255. */
    uint16_t ADCUI_ZeroCrossTimeOut;     /*!< The value of the time-out register which sets this value when the voltage signal crosses V0.
                                                                                                                  This parameter is an even number from 0 to 4095. */
} ADCUI_InitTypeDef;

/**
 * @brief ADCUI Fx unit structure.
 */
typedef struct {
    ADCUI_IntegratorState_TypeDef ADCUI_Fx_IntegratorEnable;         /*!< The state of the integrator in the I channel.
                                                                          This parameter can be a value of the @ref ADCUI_IntegratorState_TypeDef */
    ADCUI_IntegratorState_TypeDef ADCUI_F0_I3IntegratorEnable;       /*!< The state of the integrator in the I3 channel in the F0 unit.
                                                                          This parameter can be a value of the @ref ADCUI_IntegratorState_TypeDef */
    ADCUI_SourceRegFullPower_TypeDef ADCUI_SourceRegFullPower;       /*!< Enable or disable the DMA request when there is data in the FIFO.
                                                                          This parameter can be a value of the @ref ADCUI_SourceRegFullPower_TypeDef */
    ADCUI_IGain_TypeDef ADCUI_Fx_IGain;                              /*!< Specifies the level of the analog gain for I.
                                                                         This parameter can be a value of the @ref ADCUI_Gain_TypeDef */
    ADCUI_VGain_TypeDef ADCUI_Fx_VGain;                              /*!< Specifies the level of the analog gain for U.
                                                                         This parameter can be a value of the @ref ADCUI_Gain_TypeDef */
    int8_t ADCUI_Fx_PhaseShift;                                      /*!< Phase shift of the voltage channel relative to the current channel.
                                                                          This parameter is an even number from 0 to 255. */
    ADCUI_IGain_TypeDef ADCUI_F0_I3Gain;                             /*!< Specifies the level of the analog gain for I in the F0 unit.
                                                                         This parameter can be a value of the @ref ADCUI_Gain_TypeDef */
    uint16_t ADCUI_Fx_IRMSCalibration;                               /*!< Calibration of the RMS current calculator.
                                                                          This parameter is an even number from 0 to 4095. */
    uint16_t ADCUI_Fx_VRMSCalibration;                               /*!< Calibration of the RMS voltage calculator.
                                                                          This parameter is an even number from 0 to 4095. */
    ADCUI_Fx_SourceVDAT_TypeDef ADCUI_Fx_SourceVDAT;                 /*!< Selection of a signal source for the ADCUI_FxVDAT register.
                                                                          This parameter can be a value of the @ref ADCUI_Fx_SourceVDAT_TypeDef */
    ADCUI_Fx_SourceIDAT_TypeDef ADCUI_Fx_SourceIDAT;                 /*!< Selection of a signal source for the ADCUI_FxI0DAT register.
                                                                          This parameter can be a value of the @ref ADCUI_Fx_SourceIDAT_TypeDef */
    FunctionalState ADCUI_Fx_6dBIGainEnable;                         /*!< Gain 6 dB in the Ix channel.
                                                                          This parameter can be a value of the @ref FunctionalState. */
    FunctionalState ADCUI_Fx_6dBVGainEnable;                         /*!< Gain 6 dB in the U channel.
                                                                          This parameter can be a value of the @ref FunctionalState. */
    FunctionalState ADCUI_F0_6dBI3GainEnable;                        /*!< Gain 6 dB in the I3 channel, only for the F0.
                                                                          This parameter can be a value of the @ref FunctionalState. */
    ADCUI_F0_I3SelectDataFilter_TypeDef ADCUI_F0_I3SelectDataFilter; /*!< Selection of a signal source for the ADCUI_F0I3DAT register.
                                                                          This parameter can be a value of the @ref ADCUI_F0_I3SelectDataFilter_TypeDef */
#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
    ADCUI_Fx_ISelectDataFilter_TypeDef ADCUI_Fx_ISelectDataFilter; /*!< Selection of a signal source for the ADCUI_FxIDAT register.
                                                                    This parameter can be a value of the @ref ADCUI_Fx_ISelectDataFilter_TypeDef */
#endif
    ADCUI_F0_IChannelSelect_TypeDef ADCUI_F0_IChannelSelect; /*!< Selection of an active current channel for the power characteristics calculation.
                                                                  This parameter can be a value of the @ref ADCUI_F0_IChannelSelect_TypeDef */
    uint16_t ADCUI_Fx_ActivePowerOffsetCalibration;          /*!< Active power offset calibration.
                                                                  This parameter is a number from 0x0 to 0xFFFF. */
    uint16_t ADCUI_Fx_ActivePowerGainCalibration;            /*!< Active power gain calibration.
                                                                  This parameter is a number from 0x0 to 0xFFF. */
    uint16_t ADCUI_Fx_ReactivePowerOffsetCalibration;        /*!< Reactive power offset calibration.
                                                                  This parameter is a number from 0x0 to 0xFFFF. */
    uint16_t ADCUI_Fx_ReactivePowerGainCalibration;          /*!< Reactive power gain calibration.
                                                                  This parameter is a number from 0x0 to 0xFFF. */
    uint16_t ADCUI_Fx_FullPowerGainCalibration;              /*!< Full power gain calibration.
                                                                  This parameter is a number from 0x0 to 0xFFF. */
    uint16_t ADCUI_Fx_VPeakLevel;                            /*!< Permitted maximum voltage level.
                                                                  This parameter is a number from 0x0 to 0xFFFF. */
    uint16_t ADCUI_Fx_IPeakLevel;                            /*!< Permitted maximum current level.
                                                                  This parameter is a number from 0x0 to 0xFFFF. */
    uint16_t ADCUI_Fx_IGainCalibration;                      /*!< Current calibration value for the Fx unit.
                                                                  This parameter is a number from 0x0 to 0xFFF (in rev.1 MDR32F02) or to 0xFFFF (in rev.2 MDR32F02 and MDR1206). */
    uint16_t ADCUI_Fx_VGainCalibration;                      /*!< Voltage calibration value for the Fx unit.
                                                                  This parameter is a number from 0x0 to 0xFFF (in rev.1 MDR32F02) or to 0xFFFF (in rev.2 MDR32F02 and MDR1206). */
    uint16_t ADCUI_F0_I3GainCalibration;                     /*!< Current calibration value in the I3 channel, only for the F0.
                                                                  This parameter is a number from 0x0 to 0xFFF (in rev.1 MDR32F02) or to 0xFFFF (in rev.2 MDR32F02 and MDR1206). */
} ADCUI_FxUnit_InitTypeDef;

