piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/inc/MDR32VF0xI_adcui.h
/** @} */ /* End of the group ADCUI_Exported_Types */

/** @defgroup ADCUI_Exported_Functions ADCUI Exported Functions
 * @{
 */

void ADCUI_DeInit(void);
void ADCUI_Init(const ADCUI_InitTypeDef* ADCUI_InitStruct);
void ADCUI_StructInit(ADCUI_InitTypeDef* ADCUI_InitStruct);
void ADCUI_ResetDigital(FunctionalState NewState);

void ADCUI_Fx_Init(ADCUI_Unit_TypeDef UnitNumber, const ADCUI_FxUnit_InitTypeDef* ADCUI_FxUnitInitStruct);
void ADCUI_Fx_StructInit(ADCUI_FxUnit_InitTypeDef* ADCUI_FxUnitInitStruct);
void ADCUI_ChannelConfig(uint32_t Channels, FunctionalState NewState);

void ADCUI_Fx_ClearPowerCounter(ADCUI_Unit_TypeDef UnitNumber, ADCUI_Power_TypeDef PowerCounter);

uint32_t ADCUI_GetResult(ADCUI_Channel_TypeDef ChannelNumber);

uint64_t ADCUI_GetPowerAccumulator(ADCUI_Unit_TypeDef UnitNumber, ADCUI_Power_TypeDef PowerAccumulator, FunctionalState ReturnNegative);

uint32_t ADCUI_GetPeakValue(ADCUI_Channel_TypeDef ChannelNumber);
void     ADCUI_ClearPeakValue(ADCUI_Channel_TypeDef ChannelNumber);

uint32_t ADCUI_GetRMS(ADCUI_Channel_TypeDef ChannelNumber);
uint32_t ADCUI_GetRMS2(ADCUI_Channel_TypeDef ChannelNumber);

uint32_t ADCUI_GetVPhaseShiftRelativeV0(ADCUI_Channel_TypeDef ChannelNumber);

#if defined(USE_MDR32F02_REV_2) || defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
uint32_t ADCUI_GetVoltageTrueRMS(ADCUI_Unit_TypeDef UnitNumber);
#endif

#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
void ADCUI_DMAConfig(uint32_t Channels, ADCUI_DmaTransMode_TypeDef Mode, FunctionalState NewState);
void ADCUI_ChopperConfig(ADCUI_Channel_TypeDef ChannelNumber, FunctionalState NewState);
#endif

void       ADCUI_ClearFlags(ADCUI_Unit_TypeDef UnitNumber, uint32_t Flags);
FlagStatus ADCUI_GetFlagStatus(ADCUI_Unit_TypeDef UnitNumber, ADCUI_Flags_TypeDef ADCUI_Flag);
uint32_t   ADCUI_GetStatus(ADCUI_Unit_TypeDef UnitNumber);

void ADCUI_ITConfig(ADCUI_Unit_TypeDef UnitNumber, uint32_t ADCUI_IT, FunctionalState NewState);

/** @} */ /* End of the group ADCUI_Exported_Functions */

/** @} */ /* End of the group ADCUI */

/** @} */ /* End of the group MDR32VF0xI_StdPeriph_Driver */

#ifdef __cplusplus
} // extern "C" block end
#endif

#endif /* MDR32VF0xI_ADCUI_H */

/*********************** (C) COPYRIGHT 2025 Milandr ****************************
 *
 * END OF FILE MDR32VF0xI_adcui.h */

